# customer-processor - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default: Refreshing state... [id=upstash-kafka-credential-502b3767-8273-4968-87db-ab3e6e885d5c]
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/customer_processor_identity_v1_event]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.kafka_topic_customer_v1_event_credential_producer.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic_identity_v1_event_credential_consumer.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.aws_secretsmanager_secret.kafka_topic_credential_identity_v1_event: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:754682412926:secret:customer_processor_kafka_identity_v1_event-EfiNZX]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer_processor_identity_v1_event]
module.common_resources.module.kafka_topic_customer_v1_event_credential_producer.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.kafka_topic_identity_v1_event_credential_consumer.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=3b3600e9-4ff6-42aa-982f-15f19958dc4c:customer_processor]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.aws_secretsmanager_secret_version.my_secret_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:754682412926:secret:customer_processor_kafka_identity_v1_event-EfiNZX|B0BEF579-5687-4077-A6FC-6D4D834A7E2F]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-2586101c-c461-42f8-9606-a9cceec03561]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer_processor_identity_v1_event-20230516103214326200000001]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 1s [id=b18ffd3e4cbe812e076fb896621aa09a8ce561c6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.aws_secretsmanager_secret_version.my_secret_version must be replaced
-/+ resource "aws_secretsmanager_secret_version" "my_secret_version" {
      ~ arn            = "arn:aws:secretsmanager:us-east-1:754682412926:secret:customer_processor_kafka_identity_v1_event-EfiNZX" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-1:754682412926:secret:customer_processor_kafka_identity_v1_event-EfiNZX|B0BEF579-5687-4077-A6FC-6D4D834A7E2F" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "B0BEF579-5687-4077-A6FC-6D4D834A7E2F" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be created
  + resource "aws_lambda_function" "default" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/home/runner/work/Connectilly/Connectilly/artifact/identity-v1-event/lambda.zip"
      + function_name                  = "customer_processor_identity_v1_event"
      + handler                        = "main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::754682412926:role/lambda-execution-customer_processor_identity_v1_event"
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "ahVDiphFKQxNl30pZkDeVlys4hM/K+3H65OVo+JyjAc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-processor"
          + "resource_type" = "lambda"
        }
      + tags_all                       = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-processor"
          + "resource_type" = "lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer_processor"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "3b3600e9-4ff6-42aa-982f-15f19958dc4c:customer_processor"
        name       = "customer_processor"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "db8a7c9b-a8b4-4606-a192-4b2e2c7f6ea2" -> "41cb6eed-f410-4a9c-8440-3b6184a3f00b"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default will be destroyed
  # (because upstash_kafka_credential.default is not in configuration)
  - resource "upstash_kafka_credential" "default" {
      - cluster_id      = (sensitive value) -> null
      - creation_time   = 1684226279 -> null
      - credential_id   = "502b3767-8273-4968-87db-ab3e6e885d5c" -> null
      - credential_name = "customer_processor" -> null
      - id              = "upstash-kafka-credential-502b3767-8273-4968-87db-ab3e6e885d5c" -> null
      - password        = (sensitive value) -> null
      - permissions     = "CONSUME" -> null
      - state           = "active" -> null
      - topic           = "customer.v1.event" -> null
      - username        = "c2hhcmluZy1zbmlwZS02MTE3JKBLX-DjBQe1We81W7N6NNC_zAr6hxDrZEJOsg0" -> null
    }

  # module.common_resources.module.kafka_topic_customer_v1_event_credential_producer.upstash_kafka_credential.default will be created
  + resource "upstash_kafka_credential" "default" {
      + cluster_id      = (sensitive value)
      + creation_time   = (known after apply)
      + credential_id   = (known after apply)
      + credential_name = "customer_processor_producer"
      + id              = (known after apply)
      + password        = (sensitive value)
      + permissions     = "PRODUCE"
      + state           = (known after apply)
      + topic           = "customer.v1.event"
      + username        = (known after apply)
    }

  # module.common_resources.module.kafka_topic_identity_v1_event_credential_consumer.upstash_kafka_credential.default will be created
  + resource "upstash_kafka_credential" "default" {
      + cluster_id      = (sensitive value)
      + creation_time   = (known after apply)
      + credential_id   = (known after apply)
      + credential_name = "customer_processor_consumer"
      + id              = (known after apply)
      + password        = (sensitive value)
      + permissions     = "CONSUME"
      + state           = (known after apply)
      + topic           = "identity.v1.event"
      + username        = (known after apply)
    }

Plan: 5 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*